Extensions/АБ/InformationRegisters/УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПричинаБлокировкиРазблокировки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УВМ_СтатусыБлокировкиКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Extensions/АБ/Enums/УВМ_СтатусыБлокировкиКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>УВМ_СтатусыБлокировкиКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разблокирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/АБ/Enums/ТипыНалогообложенияНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыНалогообложенияНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговыйАгентПоНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоФактическомуИспользованию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаНеОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяЕНВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортСырьевыхТоваровУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭкспортНесырьевыхТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводОСВЭксплуатацию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОпределяетсяРаспределением</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДСУПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоСДЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭлектронныеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияРаботУслугНаЭкспорт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаПоПатенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеверсивноеОбложениеНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОблагаетсяНДССМежценовойРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Космос</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаОблагаетсяНДСВСтранеЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛьготноеНалогообложениеНДСНаУСН</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/АБ/CommonModules/УВМ_КлиентСервер/Ext/Module.bsl
// Функция - возвращает заголовок кнопки и имя картинки для элементов формы разрешения/запрета отгрузки
//
// Параметры:
//  КонтрагентСсылка - СправочникСсылка.Контрагенты - Ссылка на контрагента
// Возвращаемое значение:
//  СвойстваЭлементовФормы - Структура - Структура свойств для элементов формы
&НаСервере
Функция СвойстваЗапрещенаРазрешенаОтгрузкаКонтрагента(КонтрагентСсылка) Экспорт
	
	//++ РомановНЕ 20240115 (161623)
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.УВМ_ПричиныБлокировкиРазблокировкиКонтрагентов.СрезПоследних(, Контрагент = &Контрагент) КАК УВМ_ПричиныБлокировкиРазблокировкиКонтрагентовСрезПоследних";
	
	Запрос.УстановитьПараметр("Контрагент", КонтрагентСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Статус = Перечисления.УВМ_СтатусыБлокировкиКонтрагентов.Разблокирован;
		
	Иначе
		
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		Статус = Выборка.Статус;
		
	КонецЕсли;
	
	Если Статус = Перечисления.УВМ_СтатусыБлокировкиКонтрагентов.Заблокирован Тогда
		ЗаголовокКнопки = "Контрагенту запрещена отгрузка";
		ИмяКартинки = "ОформлениеКрест";
		ЦветТекста = WebЦвета.Кирпичный;
	ИначеЕсли Статус = Перечисления.УВМ_СтатусыБлокировкиКонтрагентов.Разблокирован Тогда
		ЗаголовокКнопки = "Контрагенту разрешена отгрузка";
		ИмяКартинки = "ОформлениеФлажок";
		ЦветТекста = Новый Цвет();
	КонецЕсли;
	
	СвойстваЭлементовФормы = Новый Структура;
	СвойстваЭлементовФормы.Вставить("ЗаголовокКнопки", ЗаголовокКнопки);
	СвойстваЭлементовФормы.Вставить("ИмяКартинки", ИмяКартинки);
	СвойстваЭлементовФормы.Вставить("ЦветТекста", ЦветТекста);
	
	Возврат СвойстваЭлементовФормы;
	//-- РомановНЕ 20240115 (161623)
	
КонецФункции

#Область СтавкиНДС

//++dar 30.04.26 (326008)
// Функция возвращает процент ставки НДС.
//
// Параметры:
//  СтавкаНДС - СправочникСсылка.СтавкиНДС - Ставка НДС.
//
// Возвращаемое значение:
//	Число - Процент ставки НДС.
//
Функция ЗначениеСтавкиНДС(СтавкаНДС) Экспорт
	
	Возврат УВМ_ПовтИспКлиентСервер.ЗначениеСтавкиНДС(СтавкаНДС);
	
КонецФункции

// Возвращает список типов налогообложения НДС, для которых в документах скрываются реквизиты ставки и суммы НДС
//
// Возвращаемое значение:
// 	Массив из ПеречислениеСсылка.ТипыНалогообложенияНДС - Типы налогообложений НДС
//
Функция ТипыНалогообложенияСкрывающиеРеквизитыНДС(ИмяПоляВводаСтавкиНДС = "")
	
	Результат = Новый Массив;
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.РеверсивноеОбложениеНДС"));
	
	//++ Локализация
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.РеализацияРаботУслугНаЭкспорт"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДСВСтранеЕАЭС"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаПоПатенту"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДССМежценовойРазницы"));
	Если ИмяПоляВводаСтавкиНДС <> "АвансыСтавкаНДС" Тогда
		Результат.Добавить(ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ОблагаетсяНДСУПокупателя"));
	КонецЕсли;
	//-- Локализация
	
	Возврат Результат;
	
КонецФункции

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения.
//
// Параметры:
//  Сумма            - Число - сумма от которой надо рассчитывать налоги;
//  СтавкаНДС        - Число, СправочникСсылка.СтавкиНДС - Значение или ссылка на ставку НДС.
//  СуммаВключаетНДС - Булево - признак включения НДС в сумму ("внутри" или "сверху");
//  НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС - налогообложение документа
//
// Возвращаемое значение:
//  Число - полученная сумма НДС.
//
Функция РассчитатьСуммуНДСЛокализация(Сумма, СтавкаНДС, СуммаВключаетНДС = Истина, НалогообложениеНДС = Неопределено)

	СуммаНДС = Неопределено;
	
	//++ Локализация
	Если НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ЭлектронныеУслуги") Тогда
		Если ТипЗнч(СтавкаНДС) = Тип("СправочникСсылка.СтавкиНДС") Тогда
			ЗначениеСтавкиНДС = ЗначениеСтавкиНДС(СтавкаНДС);
		Иначе
			ЗначениеСтавкиНДС = СтавкаНДС; 
		КонецЕсли;
	
		СуммаНДС = Окр(Сумма * ЗначениеСтавкиНДС / 100, 2, РежимОкругления.Окр15как20);
	КонецЕсли;
	//-- Локализация
	
	Возврат СуммаНДС;
	
КонецФункции

// Рассчитывает сумму НДС исходя из суммы и флагов налогообложения.
//
// Параметры:
//  Сумма            - Число - сумма от которой надо рассчитывать налоги;
//  СтавкаНДС        - Число, СправочникСсылка.СтавкиНДС - Значение или ссылка на ставку НДС.
//  СуммаВключаетНДС - Булево - признак включения НДС в сумму ("внутри" или "сверху");
//  НалогообложениеНДС - ПеречислениеСсылка.ТипыНалогообложенияНДС - налогообложение документа
//
// Возвращаемое значение:
//  Число - полученная сумма НДС.
//
Функция РассчитатьСуммуНДС(Сумма, СтавкаНДС, СуммаВключаетНДС = Истина, НалогообложениеНДС = Неопределено) Экспорт
	
	ТипыНалогообложения = ТипыНалогообложенияСкрывающиеРеквизитыНДС();
	Если ЗначениеЗаполнено(НалогообложениеНДС) И ТипыНалогообложения.Найти(НалогообложениеНДС) <> Неопределено Тогда
		Возврат 0;
	КонецЕсли;
	
	Если ТипЗнч(СтавкаНДС) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		ЗначениеСтавкиНДС = ЗначениеСтавкиНДС(СтавкаНДС);
	Иначе
		ЗначениеСтавкиНДС = СтавкаНДС; 
	КонецЕсли;
	
	СуммаНДС = РассчитатьСуммуНДСЛокализация(Сумма, СтавкаНДС, СуммаВключаетНДС, НалогообложениеНДС);
	
	Если СуммаНДС = Неопределено Тогда
		Если СуммаВключаетНДС Тогда
			СуммаНДС = Окр(Сумма - 100 * Сумма / (100 + ЗначениеСтавкиНДС), 2, РежимОкругления.Окр15как20);
		Иначе
			СуммаНДС = Окр(Сумма * ЗначениеСтавкиНДС / 100, 2, РежимОкругления.Окр15как20);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СуммаНДС;

КонецФункции
//--dar 30.04.26 (326008)

#КонецОбласти
